==========================================================
Table with dotted key value
==========================================================
[table]

foo.bar = 100
----------------------------------------------------------
[table]
foo.bar = 100

==========================================================
Table with dotted key value with strings
==========================================================
[table]

foo."bar hello".baz = 100
----------------------------------------------------------
[table]
foo."bar hello".baz = 100

==========================================================
Table with dotted key value with strings and spaces
==========================================================
[table]

foo  .  "bar hello"  .  baz = 100
----------------------------------------------------------
[table]
foo."bar hello".baz = 100

==========================================================
Table with commented keys
==========================================================
[table]

# this is a comment
foo = 100
----------------------------------------------------------
[table]
# this is a comment
foo = 100
