==========================================================
Simple table
==========================================================
[name]

key = "value"
----------------------------------------------------------
[name]
key = "value"

==========================================================
Table with dotted name
==========================================================
[table.foo]
----------------------------------------------------------
[table.foo]

==========================================================
Table with dotted name with strings
==========================================================
[table."foo hello".bar]
----------------------------------------------------------
[table."foo hello".bar]

==========================================================
Table with dotted name with strings and spaces
==========================================================
[table  . "foo hello" .  bar]
----------------------------------------------------------
[table."foo hello".bar]
