==========================================================
Simple empty multiline string
==========================================================
"""
"""
----------------------------------------------------------
0:7: triple_string ("""\n""")
7:0: eof ()

==========================================================
Simple empty multiline literal string with single quotes
==========================================================
'''
'''
----------------------------------------------------------
0:7: triple_string ('''\n''')
7:0: eof ()

==========================================================
Multiline string
==========================================================
"""
Roses are red
Violets are blue"""
----------------------------------------------------------
0:37: triple_string ("""\nRoses are red\nViolets are blue""")
37:0: eof ()

==========================================================
Multiline string with quotes
==========================================================
"""Here are two quotation marks: "". Simple enough."""
----------------------------------------------------------
0:54: triple_string ("""Here are two quotation marks: "". Simple enough.""")
54:0: eof ()

==========================================================
Multiline string with almost three quotes
==========================================================
"""Here are three quotation marks: ""\"."""
----------------------------------------------------------
0:43: triple_string ("""Here are three quotation marks: ""\".""")
43:0: eof ()

==========================================================
Multiline string with too many quotes
==========================================================
"""Here are fifteen quotation marks: ""\"""\"""\"""\"""\"."""
----------------------------------------------------------
0:61: triple_string ("""Here are fifteen quotation marks: ""\"""\"""\"""\"""\".""")
61:0: eof ()

==========================================================
Multiline string with four quotes
==========================================================
""""This," she said, "is just a pointless statement.""""
----------------------------------------------------------
0:56: triple_string (""""This," she said, "is just a pointless statement."""")
56:0: eof ()

==========================================================
Multiline string with line ending backslash
==========================================================
"""
The quick brown \


  fox jumps over \
    the lazy dog."""
----------------------------------------------------------
0:63: triple_string ("""\nThe quick brown \\n\n\n  fox jumps over \\n    the lazy dog.""")
63:0: eof ()

==========================================================
Multiline literal string with escapes
==========================================================
'''
hello \n
world
'''
----------------------------------------------------------
0:22: triple_string ('''\nhello \n\nworld\n''')
22:0: eof ()

==========================================================
Multiline literal string invalid escapes
==========================================================
'''
at
C:\Users\nodejs\templates
'''
----------------------------------------------------------
0:36: triple_string ('''\nat\nC:\Users\nodejs\templates\n''')
36:0: eof ()

==========================================================
Multiline literal string with two single quotes
==========================================================
'''
hello ''world''
hello ''world
'''
----------------------------------------------------------
0:37: triple_string ('''\nhello ''world''\nhello ''world\n''')
37:0: eof ()

==========================================================
Multiline literal string with regex
==========================================================
'''I [dw]on't need \d{2} apples'''
----------------------------------------------------------
0:34: triple_string ('''I [dw]on't need \d{2} apples''')
34:0: eof ()

==========================================================
Multiline literal string with Base64 encoded data
==========================================================
'''
aGVsbG8gd29ybGQ=
'''
----------------------------------------------------------
0:24: triple_string ('''\naGVsbG8gd29ybGQ=\n''')
24:0: eof ()
